<a href="https://colab.research.google.com/github/hijinkim/TIL/blob/master/Data_Preprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Missing Value

In [ ]:
import seaborn as sns
DF = sns.load_dataset('titanic')

DF.head(10)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True
5         0       3    male   NaN  ...   NaN   Queenstown     no   True
6         0       1    male  54.0  ...     E  Southampton     no   True
7         0       3    male   2.0  ...   NaN  Southampton     no  False
8         1       3  female  27.0  ...   NaN  Southampton    yes  False
9         1       2  female  14.0  ...   NaN    Cherbourg    yes  False

[10 rows x 15 columns]

In [ ]:
DF.shape

(891, 15)

In [ ]:
DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [ ]:
DF['deck'].value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [ ]:
DF.head(10).isnull()

   survived  pclass    sex    age  ...   deck  embark_town  alive  alone
0     False   False  False  False  ...   True        False  False  False
1     False   False  False  False  ...  False        False  False  False
2     False   False  False  False  ...   True        False  False  False
3     False   False  False  False  ...  False        False  False  False
4     False   False  False  False  ...   True        False  False  False
5     False   False  False   True  ...   True        False  False  False
6     False   False  False  False  ...  False        False  False  False
7     False   False  False  False  ...   True        False  False  False
8     False   False  False  False  ...   True        False  False  False
9     False   False  False  False  ...   True        False  False  False

[10 rows x 15 columns]

In [ ]:
DF.isnull().sum(axis=0)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [ ]:
DF.head(10).notnull()

   survived  pclass   sex    age  ...   deck  embark_town  alive  alone
0      True    True  True   True  ...  False         True   True   True
1      True    True  True   True  ...   True         True   True   True
2      True    True  True   True  ...  False         True   True   True
3      True    True  True   True  ...   True         True   True   True
4      True    True  True   True  ...  False         True   True   True
5      True    True  True  False  ...  False         True   True   True
6      True    True  True   True  ...   True         True   True   True
7      True    True  True   True  ...  False         True   True   True
8      True    True  True   True  ...  False         True   True   True
9      True    True  True   True  ...  False         True   True   True

[10 rows x 15 columns]

In [ ]:
DF.isnull().sum(axis=0)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [ ]:
DF.dropna(thresh=300, axis=1).shape

(891, 14)

In [ ]:
DF.shape

(891, 15)

In [ ]:
DF.dropna(subset=['age'], how='any', axis=0).shape

(714, 15)

In [ ]:
DF['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [ ]:
DF['age'].fillna(int(DF['age'].mean(axis=0)), inplace=True)

In [ ]:
DF['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    29.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [ ]:
DF['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [ ]:
most_freq = DF['embark_town'].value_counts(dropna=True).idxmax()
most_freq

'Southampton'

In [ ]:
DF['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [ ]:
DF = sns.load_dataset('titanic')
DF['embark_town'][828:831]

828    Queenstown
829           NaN
830     Cherbourg
Name: embark_town, dtype: object

In [ ]:
DF['embark_town'].fillna(method='ffill', inplace=True)
DF['embark_town'][828:831]

828    Queenstown
829    Queenstown
830     Cherbourg
Name: embark_town, dtype: object

In [ ]:
DF = sns.load_dataset('titanic')
DF['embark_town'][828:831]

828    Queenstown
829           NaN
830     Cherbourg
Name: embark_town, dtype: object

In [ ]:
DF['embark_town'].fillna(method='bfill', inplace=True)
DF['embark_town'][828:831]

828    Queenstown
829     Cherbourg
830     Cherbourg
Name: embark_town, dtype: object

## apply()

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

DF = titanic.loc[:, ['age', 'fare']].head()
DF

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [ ]:
DF.apply(sum, axis=0)

age     156.0000
fare    147.6083
dtype: float64

In [ ]:
DF.apply(sum, axis=1)

0     29.2500
1    109.2833
2     33.9250
3     88.1000
4     43.0500
dtype: float64

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [ ]:
titanic.head(3)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True

[3 rows x 15 columns]

In [ ]:
Filter_1 = (titanic.age >= 20) & (titanic.age < 30)
titanic.loc[Filter_1, :].head()

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0          0       3    male  22.0  ...   NaN  Southampton     no  False
2          1       3  female  26.0  ...   NaN  Southampton    yes   True
8          1       3  female  27.0  ...   NaN  Southampton    yes  False
12         0       3    male  20.0  ...   NaN  Southampton     no   True
23         1       1    male  28.0  ...     A  Southampton    yes   True

[5 rows x 15 columns]

In [ ]:
Filter_2 = (titanic.age < 20) & (titanic.sex == 'female')
titanic.loc[Filter_2, :].head()

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
9          1       2  female  14.0  ...   NaN    Cherbourg    yes  False
10         1       3  female   4.0  ...     G  Southampton    yes  False
14         0       3  female  14.0  ...   NaN  Southampton     no   True
22         1       3  female  15.0  ...   NaN   Queenstown    yes   True
24         0       3  female   8.0  ...   NaN  Southampton     no  False

[5 rows x 15 columns]

In [ ]:
Filter_3 = (titanic.age < 10) | (titanic.age >= 50)
titanic.loc[Filter_3, ['age', 'sex', 'alone']].head()

     age     sex  alone
6   54.0    male   True
7    2.0    male  False
10   4.0  female  False
11  58.0  female   True
15  55.0  female   True

In [ ]:
Filter_isin = titanic['sibsp'].isin([3, 4, 5])
titanic[Filter_isin].head()

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
7          0       3    male   2.0  ...   NaN  Southampton     no  False
16         0       3    male   2.0  ...   NaN   Queenstown     no  False
24         0       3  female   8.0  ...   NaN  Southampton     no  False
27         0       1    male  19.0  ...     C  Southampton     no  False
50         0       3    male   7.0  ...   NaN  Southampton     no  False

[5 rows x 15 columns]

In [ ]:
import pandas as pd

DF1 = pd.DataFrame({'A' : ['a1', 'a2', 'a3', 'a4'],
                    'B' : ['b1', 'b2', 'b3', 'b4'],
                    'C' : ['c1', 'c2', 'c3', 'c4']},
                   index=['', '', '', ''])

DF1

     A   B   C
  a1  b1  c1
   a2  b2  c2
   a3  b3  c3
   a4  b4  c4

In [ ]:
DF2 = pd.DataFrame({'C' : ['c1', 'c2'],
                    'D' : ['d1', 'd2'],
                    'E' : ['e1', 'e2'],
                    'F' : ['f1', 'f2']},
                   index=['', ''])

DF2

     C   D   E   F
  c1  d1  e1  f1
   c2  d2  e2  f2

In [ ]:
pd.concat([DF1, DF2], axis=0)

      A    B   C    D    E    F
   a1   b1  c1  NaN  NaN  NaN
    a2   b2  c2  NaN  NaN  NaN
    a3   b3  c3  NaN  NaN  NaN
    a4   b4  c4  NaN  NaN  NaN
  NaN  NaN  c1   d1   e1   f1
   NaN  NaN  c2   d2   e2   f2

In [ ]:
pd.concat([DF1, DF2], axis=1)

     A   B   C    C    D    E    F
  a1  b1  c1   c1   d1   e1   f1
   a2  b2  c2   c2   d2   e2   f2
   a3  b3  c3  NaN  NaN  NaN  NaN
   a4  b4  c4  NaN  NaN  NaN  NaN

In [ ]:
pd.concat([DF1, DF2], axis=0, ignore_index=True)

     A    B   C    D    E    F
0   a1   b1  c1  NaN  NaN  NaN
1   a2   b2  c2  NaN  NaN  NaN
2   a3   b3  c3  NaN  NaN  NaN
3   a4   b4  c4  NaN  NaN  NaN
4  NaN  NaN  c1   d1   e1   f1
5  NaN  NaN  c2   d2   e2   f2

In [ ]:
pd.concat([DF1, DF2], axis=1, join='inner')

     A   B   C   C   D   E   F
  a1  b1  c1  c1  d1  e1  f1
   a2  b2  c2  c2  d2  e2  f2

In [ ]:
pd.concat([DF1, DF2], axis=1, join='outer')

     A   B   C    C    D    E    F
  a1  b1  c1   c1   d1   e1   f1
   a2  b2  c2   c2   d2   e2   f2
   a3  b3  c3  NaN  NaN  NaN  NaN
   a4  b4  c4  NaN  NaN  NaN  NaN

In [ ]:
pd.merge(DF1, DF2, how='inner')

    A   B   C   D   E   F
0  a1  b1  c1  d1  e1  f1
1  a2  b2  c2  d2  e2  f2

In [ ]:
pd.merge(DF1, DF2, how='outer')

    A   B   C    D    E    F
0  a1  b1  c1   d1   e1   f1
1  a2  b2  c2   d2   e2   f2
2  a3  b3  c3  NaN  NaN  NaN
3  a4  b4  c4  NaN  NaN  NaN

In [ ]:
pd.merge(DF1, DF2, how='left')

    A   B   C    D    E    F
0  a1  b1  c1   d1   e1   f1
1  a2  b2  c2   d2   e2   f2
2  a3  b3  c3  NaN  NaN  NaN
3  a4  b4  c4  NaN  NaN  NaN

In [ ]:
pd.merge(DF1, DF2, how='right')

    A   B   C   D   E   F
0  a1  b1  c1  d1  e1  f1
1  a2  b2  c2  d2  e2  f2

###

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

DF = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]
DF.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

In [ ]:
grouped = DF.groupby(['class'])
grouped

In [ ]:
for key in ['First', 'Second', 'Third']:
  print(grouped.get_group(key).head(5))
  print('\n')

     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1


     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1


    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

In [ ]:
grouped.mean()

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

In [ ]:
grouped.get_group('Third').head(3)

    age     sex  class   fare  survived
0  22.0    male  Third  7.250         0
2  26.0  female  Third  7.925         1
4  35.0    male  Third  8.050         0

In [ ]:
grouped_TWO = DF.groupby(['class', 'sex'])
grouped_TWO

In [ ]:
for key, group in grouped_TWO:
  print('* key : ', key)
  print('* number : ', len(group))
  print(group.head(3))
  print('\n')

* key :  ('First', 'female')
* number :  94
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
11  58.0  female  First  26.5500         1


* key :  ('First', 'male')
* number :  122
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0


* key :  ('Second', 'female')
* number :  76
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0


* key :  ('Second', 'male')
* number :  108
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1


* key :  ('Third', 'female')
* number :  144
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1


* key :  ('Third', 'male')
* number :  347
    age   sex  class    fare  survived
0  22.0  male  Third  7.2500         0
4  35.0  male  Third  8.0500         0
5   NaN  male  Third  8.4583         0

In [ ]:
grouped_TWO.mean()

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

In [ ]:
grouped_TWO.get_group(('First', 'female')).head(3)

     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
11  58.0  female  First  26.5500         1

In [ ]:
grouped.agg(['mean', 'std'])

              age                  fare             survived
             mean        std       mean        std      mean       std
class
First   38.233441  14.802856  84.154687  78.380373  0.629630  0.484026
Second  29.877630  14.001077  20.662183  13.417399  0.472826  0.500623
Third   25.140620  12.495398  13.675550  11.778142  0.242363  0.428949

In [ ]:
grouped_TWO.agg(['mean', 'std'])

                     age                   fare             survived
                    mean        std        mean        std      mean       std
class  sex
First  female  34.611765  13.612052  106.125798  74.259988  0.968085  0.176716
       male    41.281386  15.139570   67.226127  77.548021  0.368852  0.484484
Second female  28.722973  12.872702   21.970121  10.891796  0.921053  0.271448
       male    30.740707  14.793894   19.741782  14.922235  0.157407  0.365882
Third  female  21.750000  12.729964   16.118810  11.690314  0.500000  0.501745
       male    26.507589  12.159514   12.661633  11.681696  0.135447  0.342694

In [ ]:
grouped.fare.agg(['min', 'max'])

        min       max
class
First   0.0  512.3292
Second  0.0   73.5000
Third   0.0   69.5500

In [ ]:
grouped.agg({'fare': ['min', 'max'], 'age': ['mean', 'std']})

       fare                  age
        min       max       mean        std
class
First   0.0  512.3292  38.233441  14.802856
Second  0.0   73.5000  29.877630  14.001077
Third   0.0   69.5500  25.140620  12.495398

In [ ]:
def z_score(x):
  return (x - x.mean()) / x.std()

In [ ]:
DF['z_score'] = grouped.age.transform(z_score)

In [ ]:
DF.head(5)

    age     sex  class     fare  survived   z_score
0  22.0    male  Third   7.2500         0 -0.251342
1  38.0  female  First  71.2833         1 -0.015770
2  26.0  female  Third   7.9250         1  0.068776
3  35.0  female  First  53.1000         1 -0.218434
4  35.0    male  Third   8.0500         0  0.789041

In [ ]:
grouped.filter(lambda x : len(x) >= 200).head(5)

    age     sex  class     fare  survived   z_score
0  22.0    male  Third   7.2500         0 -0.251342
1  38.0  female  First  71.2833         1 -0.015770
2  26.0  female  Third   7.9250         1  0.068776
3  35.0  female  First  53.1000         1 -0.218434
4  35.0    male  Third   8.0500         0  0.789041

In [ ]:
grouped.apply(len)

class
First     216
Second    184
Third     491
dtype: int64

In [ ]:
grouped.filter(lambda x: x.age.mean() < 30).tail(3)

      age     sex   class   fare  survived   z_score
886  27.0    male  Second  13.00         0 -0.205529
888   NaN  female   Third  23.45         0       NaN
890  32.0    male   Third   7.75         0  0.548953

In [ ]:
grouped.age.mean()

class
First     38.233441
Second    29.877630
Third     25.140620
Name: age, dtype: float64

In [ ]:
grouped.apply(lambda x : x.describe())

                     age        fare    survived       z_score
class
First  count  186.000000  216.000000  216.000000  1.860000e+02
       mean    38.233441   84.154687    0.629630 -6.327077e-17
       std     14.802856   78.380373    0.484026  1.000000e+00
       min      0.920000    0.000000    0.000000 -2.520692e+00
       25%     27.000000   30.923950    0.000000 -7.588698e-01
       50%     37.000000   60.287500    1.000000 -8.332452e-02
       75%     49.000000   93.500000    1.000000  7.273299e-01
       max     80.000000  512.329200    1.000000  2.821520e+00
Second count  173.000000  184.000000  184.000000  1.730000e+02
       mean    29.877630   20.662183    0.472826 -7.043178e-17
       std     14.001077   13.417399    0.500623  1.000000e+00
       min      0.670000    0.000000    0.000000 -2.086099e+00
       25%     23.000000   13.000000    0.000000 -4.912215e-01
       50%     29.000000   14.250000    0.000000 -6.268304e-02
       75%     36.000000   26.000000    1.000000  4.372785e-01
       max     70.000000   73.500000    1.000000  2.865663e+00
Third  count  355.000000  491.000000  491.000000  3.550000e+02
       mean    25.140620   13.675550    0.242363 -1.241573e-16
       std     12.495398   11.778142    0.428949  1.000000e+00
       min      0.420000    0.000000    0.000000 -1.978378e+00
       25%     18.000000    7.750000    0.000000 -5.714600e-01
       50%     24.000000    8.050000    0.000000 -9.128318e-02
       75%     32.000000   15.500000    0.000000  5.489525e-01
       max     74.000000   69.550000    1.000000  3.910190e+00

In [ ]:
grouped.apply(lambda x : x.age.mean() < 30)

class
First     False
Second     True
Third      True
dtype: bool

##

In [ ]:
grouped_MI = DF.groupby(['class', 'sex'])

In [ ]:
grouped_MI.mean()

                     age        fare  survived   z_score
class  sex
First  female  34.611765  106.125798  0.968085 -0.244661
       male    41.281386   67.226127  0.368852  0.205903
Second female  28.722973   21.970121  0.921053 -0.082469
       male    30.740707   19.741782  0.157407  0.061644
Third  female  21.750000   16.118810  0.500000 -0.271349
       male    26.507589   12.661633  0.135447  0.109398

In [ ]:
grouped_MI.mean().xs('First', level='class')

              age        fare  survived   z_score
sex
female  34.611765  106.125798  0.968085 -0.244661
male    41.281386   67.226127  0.368852  0.205903

In [ ]:
grouped_MI.mean().xs('female', level='sex')

              age        fare  survived   z_score
class
First   34.611765  106.125798  0.968085 -0.244661
Second  28.722973   21.970121  0.921053 -0.082469
Third   21.750000   16.118810  0.500000 -0.271349

In [ ]:
grouped_MI.mean().xs(['First', 'male'], level=['class', 'sex'])

                  age       fare  survived   z_score
class sex
First male  41.281386  67.226127  0.368852  0.205903

## pivot_table()

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

DF = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]
DF.head(3)

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1

In [ ]:
DF_1 = pd.pivot_table(DF,
                      index='class',
                      columns='sex',
                      values='age',
                      aggfunc='mean')
DF_1

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

In [ ]:
DF_2 = pd.pivot_table(DF,
                      index='class',
                      columns='sex',
                      values='survived',
                      aggfunc=['mean', 'sum'])

DF_2

            mean              sum
sex       female      male female male
class
First   0.968085  0.368852     91   45
Second  0.921053  0.157407     70   17
Third   0.500000  0.135447     72   47

In [ ]:
DF_3 = pd.pivot_table(DF,
                      index=['class', 'sex'],
                      columns='survived',
                      values=['age', 'fare'],
                      aggfunc=['mean', 'max'])

DF_3

                    mean                         ...   max
                     age                   fare  ...   age    fare
survived               0          1           0  ...     1       0         1
class  sex                                       ...
First  female  25.666667  34.939024  110.604167  ...  63.0  151.55  512.3292
       male    44.581967  36.248000   62.894910  ...  80.0  263.00  512.3292
Second female  36.000000  28.080882   18.250000  ...  55.0   26.00   65.0000
       male    33.369048  16.022000   19.488965  ...  62.0   73.50   39.0000
Third  female  23.818182  19.329787   19.773093  ...  63.0   69.55   31.3875
       male    27.255814  22.274211   12.204469  ...  45.0   69.55   56.4958

[6 rows x 8 columns]

In [ ]:
DF_3.index

MultiIndex([( 'First', 'female'),
            ( 'First',   'male'),
            ('Second', 'female'),
            ('Second',   'male'),
            ( 'Third', 'female'),
            ( 'Third',   'male')],
           names=['class', 'sex'])

In [ ]:
DF_3.columns

MultiIndex([('mean',  'age', 0),
            ('mean',  'age', 1),
            ('mean', 'fare', 0),
            ('mean', 'fare', 1),
            ( 'max',  'age', 0),
            ( 'max',  'age', 1),
            ( 'max', 'fare', 0),
            ( 'max', 'fare', 1)],
           names=[None, None, 'survived'])

In [ ]:
DF_3.xs('First', axis=0)

               mean                         ...   max
                age                   fare  ...   age    fare
survived          0          1           0  ...     1       0         1
sex                                         ...
female    25.666667  34.939024  110.604167  ...  63.0  151.55  512.3292
male      44.581967  36.248000   62.894910  ...  80.0  263.00  512.3292

[2 rows x 8 columns]

In [ ]:
DF_3.xs(('First', 'female'), axis=0)

            survived
mean  age   0            25.666667
            1            34.939024
      fare  0           110.604167
            1           105.978159
max   age   0            50.000000
            1            63.000000
      fare  0           151.550000
            1           512.329200
Name: (First, female), dtype: float64

In [ ]:
DF_3.xs('male', level='sex', axis=0)

               mean                        ...   max
                age                  fare  ...   age    fare
survived          0          1          0  ...     1       0         1
class                                      ...
First     44.581967  36.248000  62.894910  ...  80.0  263.00  512.3292
Second    33.369048  16.022000  19.488965  ...  62.0   73.50   39.0000
Third     27.255814  22.274211  12.204469  ...  45.0   69.55   56.4958

[3 rows x 8 columns]

In [ ]:
DF_3.xs(('First', 'male'), level=['class', 'sex'], axis=0)

                 mean                               max
                  age              fare             age         fare
survived            0       1         0         1     0     1      0         1
class sex
First male  44.581967  36.248  62.89491  74.63732  71.0  80.0  263.0  512.3292

In [ ]:
DF_3.xs('mean', axis=1)

                     age                   fare
survived               0          1           0           1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159
       male    44.581967  36.248000   62.894910   74.637320
Second female  36.000000  28.080882   18.250000   22.288989
       male    33.369048  16.022000   19.488965   21.095100
Third  female  23.818182  19.329787   19.773093   12.464526
       male    27.255814  22.274211   12.204469   15.579696

In [ ]:
DF_3.xs(('mean', 'fare'), axis=1)

survived                0           1
class  sex
First  female  110.604167  105.978159
       male     62.894910   74.637320
Second female   18.250000   22.288989
       male     19.488965   21.095100
Third  female   19.773093   12.464526
       male     12.204469   15.579696

In [ ]:
DF_3.xs(('max', 'age', 0), level=[0, 1, 'survived'], axis=1)

                max
                age
survived          0
class  sex
First  female  50.0
       male    71.0
Second female  57.0
       male    70.0
Third  female  48.0
       male    74.0

In [ ]:
DF_3.xs(1, level='survived', axis=1)

                    mean               max
                     age        fare   age      fare
class  sex
First  female  34.939024  105.978159  63.0  512.3292
       male    36.248000   74.637320  80.0  512.3292
Second female  28.080882   22.288989  55.0   65.0000
       male    16.022000   21.095100  62.0   39.0000
Third  female  19.329787   12.464526  63.0   31.3875
       male    22.274211   15.579696  45.0   56.4958